{
  "slang": "Slang",
  "idioms": "Idioms",
  "quizzes": "Quizzes",
  "dictionary": "Dictionary",
  "show": "Show",
  "more": "more",
  "less": "less",
  "learnMore": "Learn more",
  "heroText": "A website comparing English slang and idioms",
  "discoverMore": "Discover more",
  "discoverMoreCard0Text": "Learn about popular slang words used in American and British English.",
  "discoverMoreCard1Text": "Discover common English idioms used in British and American English.",
  "discoverMoreCard2Text": "Test your knowledge of English slang and idioms with quizzes.",
  "discoverMoreCard3Text": "Find the definitions and pronunciations of English words with this online dictionary.",
  "search": "Search",
  "dictionatyMessage": "Search for a word to get its definitions and pronunciations",
  "IdiomsIntro": "An idiom is a culturally understood expression that has a figurative or metaphorical meaning, often different from its literal interpretation. Here are some interesting British and American idioms that you can use to improve your English language skills.",
  "britishIdiomsBobsYourUncle": "Means \"and there it is\", or \"and there you have it\"",
  "britishIdiomsAddAnotherString": "To acquire a new skill to help you find a job or otherwise succeed in life. It could also mean to have an additional resource or backup plan.",
  "britishIdiomsThatWentDown": "Means that something was very enjoyable. Most often used to refer to food.",
  "britishIdiomsNotMyCup": "Means \"I don't like it\".",
  "britishIdiomsDonkeysYears": "Means that something hasn't happened in a very long time, especially when referring to something that's been out of style - or at least out of sight - for ages.",
  "americanIdiomsGetYourDucks": "To make proper plans, get things in order.",
  "americanIdiomsOutOfYourLeague": "Above or beyond what one is capable of attaining.",
  "americanIdiomsBareBones": "A very basic model or version, with no extras or add-ons.",
  "americanIdiomsJumpOnTheBandwagon": "To do something because everyone is doing it.",
  "americanIdiomsUpMyAlley": "Something that you really like, or something that is within your skillset.",
  "SlangIntro": "Slang is informal vocabulary that often comes up in everyday conversation. Here are some common British and American slang words you can use to sound like a native speaker.",
  "BritishSlangMate": "British slang for a friend. Similar to \"dude\" in American English.",
  "BritishSlangCheeky": "Slightly rude or showing no respect, but often in a funny way.",
  "BritishSlangBodged": "Used to describe something, usually a job, that is done badly.",
  "BritishSlangGutted": "Extremely disappointed or upset.",
  "BritishSlangQuid": "A slang word for \"pound\".",
  "BritishSlangKnackered": "Really tired, exhausted.",
  "BritishSlangDodgy": "Used to mean anything that's low-quality, potentially dangerous or unreliable.",
  "AmericanSlangLegit": "Something that is good or worthwhile. Short for legitimate (meaning authentic or real).",
  "AmericanSlangGoDutch": "Every person pays for their own food/drinks.",
  "AmericanSlangZoneOut": "To get distracted and not pay attention to what is happening around you.",
  "AmericanSlangDude": "A casual greeting used instead of first names. Similar to mate in British English.",
  "AmericanSlangCurveBall": "Something tricky or unexpected, like trying to hit a curve ball in baseball.",
  "AmericanSlangDitch": "To leave a place or person unexpectedly, or to not show up to prior plans.",
  "AmericanSlangHaveDibsOn": "A right to have or get something from someone, or to use something.",
  "Sources": "Sources"
}
