{
  "slang": "Slang",
  "idioms": "Idiomy",
  "quizzes": "Quizy",
  "dictionary": "Słownik",
  "show": "Pokaż",
  "more": "więcej",
  "less": "mniej",
  "learnMore": "Więcej",
  "heroText": "Strona internetowa, która zgłębia niuanse języka angielskiego",
  "discoverMore": "Odkryj więcej",
  "discoverMoreCard0Text": "Zapoznaj się z różnicami między amerykańskim i brytyjskim angielskim dzięki naszemu wszechstronnemu przewodnikowi po odmianach słownictwa.",
  "discoverMoreCard1Text": "Odkryj popularne angielskie idiomy i powiedzenia dzięki naszemu zabawnemu i pouczającemu przewodnikowi. Dowiedz się o ich znaczeniach, pochodzeniu i jak ich używać w codziennej rozmowie.",
  "discoverMoreCard2Text": "Sprawdź swoją wiedzę z języka angielskiego dzięki naszym interesującym quizom. Wyzwij siebie i rywalizuj ze znajomymi, aby zobaczyć, kto jest prawdziwym ekspertem językowym.",
  "discoverMoreCard3Text": "Znajdź definicje i wymowę angielskich słów i wyrażeń dzięki naszemu słownikowi online.",
  "search": "Szukaj",
  "dictionatyMessage": "Wyszukaj słowo, aby uzyskać jego definicje i wymowę",
  "IdiomsIntro": "Idiom to kulturowo rozumiane wyrażenie mające znaczenie figuratywne lub metaforyczne, często różniące się od dosłownej interpretacji. Oto kilka interesujących brytyjskich i amerykańskich idiomów, których możesz użyć, aby polepszyć swoje umiejętności języka angielskiego.",
  "britishIdiomsBobsYourUncle": "Oznacza \"i oto jest\", lub \"i oto masz\"",
  "britishIdiomsAddAnotherString": "Nabyć nową umiejętność, która pomoże Ci znaleźć pracę lub odnieść sukces w życiu. Może również oznaczać posiadanie dodatkowego zasobu lub planu awaryjnego.",
  "britishIdiomsThatWentDown": "Oznacza, że coś było bardzo przyjemne. Najczęściej odnosi się do jedzenia.",
  "britishIdiomsNotMyCup": "Oznacza \"nie lubię tego\".",
  "britishIdiomsDonkeysYears": "Oznacza, że coś nie wydarzyło się przez bardzo długi czas, szczególnie gdy chodzi o coś, co wyszło z mody - lub przynajmniej zniknęło - na wieki.",
  "americanIdiomsGetYourDucks": "Ułożyć odpowiednie plany, uporządkować rzeczy.",
  "americanIdiomsOutOfYourLeague": "Ponad to, na co jesteś zdolny osiągnąć.",
  "americanIdiomsBareBones": "Bardzo podstawowy model lub wersja, bez dodatków.",
  "americanIdiomsJumpOnTheBandwagon": "Zrobić coś, ponieważ wszyscy to robią.",
  "americanIdiomsUpMyAlley": "Coś, co bardzo lubisz, lub coś, co jest w twoim zakresie umiejętności.",
  "SlangIntro": "Slang to zabawny sposób, aby dodać smaku do rozmów i brzmieć jak rodzimy użytkownik języka. Są nieformalne i często używane w codziennej rozmowie. Oto kilka popularnych brytyjskich i amerykańskich słów slangowych, których możesz użyć.",
  "BritishSlangMate": "Slang brytyjski oznaczający przyjaciela. Podobne do \"kolego\" w języku amerykańskim.",
  "BritishSlangCheeky": "Trochę niegrzeczny lub nie okazujący szacunku, ale często w zabawny sposób.",
  "BritishSlangBodged": "Używane do opisania czegoś, zwykle pracy, która jest wykonana źle.",
  "BritishSlangGutted": "Bardzo rozczarowany lub zmartwiony.",
  "BritishSlangQuid": "Słowo slangowe oznaczające funta.",
  "BritishSlangKnackered": "Bardzo zmęczony, wyczerpany.",
  "BritishSlangDodgy": "Używane do określenia czegoś, co jest niskiej jakości, potencjalnie niebezpieczne lub niewiarygodne.",
  "AmericanSlangLegit": "Coś, co jest dobre lub wartościowe. Skrót od słowa legitimate (oznaczającego autentyczny lub prawdziwy).",
  "AmericanSlangGoDutch": "Każda osoba płaci za swoje jedzenie/napoje.",
  "AmericanSlangZoneOut": "Zostać rozkojarzonym i nie zwracać uwagi na to, co dzieje się wokół.",
  "AmericanSlangDude": "Luźne przywitanie używane zamiast imion. Podobne do słowa mate w języku brytyjskim.",
  "AmericanSlangCurveBall": "Coś podstępnego lub nieoczekiwanego, jak próba uderzenia w krzywą piłkę w baseballu.",
  "AmericanSlangDitch": "Opuszczenie miejsca lub osoby niespodziewanie lub niepojawienie się na wcześniejsze plany.",
  "AmericanSlangHaveDibsOn": "Prawo do posiadania lub otrzymywania czegoś od kogoś, lub korzystania z czegoś."
}
