{
  "slang": "Slang",
  "idioms": "Idiomy",
  "quizzes": "Quizy",
  "dictionary": "Słownik",
  "show": "Pokaż",
  "more": "więcej",
  "less": "mniej",
  "learnMore": "Więcej",
  "heroText": "Strona porównująca angielski slang i idiomy",
  "discoverMore": "Odkryj więcej",
  "discoverMoreCard0Text": "Dowiedz się o popularnych słowach slangowych używanych w amerykańskim i brytyjskim angielskim.",
  "discoverMoreCard1Text": "Odkryj często używane idiomy w brytyjskim i amerykańskim angielskim.",
  "discoverMoreCard2Text": "Sprawdź swoją znajomość angielskiego slangu i idiomów za pomocą quizów.",
  "discoverMoreCard3Text": "Znajdź definicje i wymowę angielskich słów w tym słowniku online.",
  "search": "Szukaj",
  "dictionatyMessage": "Wyszukaj słowo, aby uzyskać jego definicje i wymowę",
  "IdiomsIntro": "Idiom to kulturowo rozumiane wyrażenie mające znaczenie figuratywne lub metaforyczne, często różniące się od dosłownej interpretacji. Tutaj znajdziesz kilka ciekawych brytyjskich i amerykańskich idiomów, których możesz użyć, aby polepszyć swoje umiejętności języka angielskiego.",
  "britishIdiomsBobsYourUncle": "Oznacza \"załatwione\", \"po sprawie\", \"gotowe\"",
  "britishIdiomsAddAnotherString": "Nabyć nową umiejętność, która pomoże znaleźć pracę lub odnieść sukces w życiu. Może również oznaczać posiadanie opcji alternatywnej.",
  "britishIdiomsThatWentDown": "Oznacza, że coś było bardzo przyjemne. Najczęściej odnosi się do jedzenia.",
  "britishIdiomsNotMyCup": "Oznacza \"to nie moja bajka (zainteresowanie)\".",
  "britishIdiomsDonkeysYears": "Oznacza, że coś nie wydarzyło się przez bardzo długi czas.",
  "americanIdiomsGetYourDucks": "Dobrze zorganizować swoje sprawy, poukładać sobie wszystko po kolei, dobrze się do czegoś przygotować.",
  "americanIdiomsOutOfYourLeague": "Być poza czyimś zasięgiem, nie mieć szans, być nie dla kogoś.",
  "americanIdiomsBareBones": "Bardzo podstawowy model lub wersja, bez dodatków.",
  "americanIdiomsJumpOnTheBandwagon": "Zrobić coś, ponieważ wszyscy to robią.",
  "americanIdiomsUpMyAlley": "Oznacza, że coś idealnie pasuje do czyichś zainteresowań, umiejętności lub preferencji.",
  "SlangIntro": "Slang to nieformalne słownictwo, które często pojawia się w codziennych rozmowach. Tutaj znajdziesz kilka popularnych brytyjskich i amerykańskich słów slangowych, których możesz użyć aby brzmieć jak rodzimy użytkownik języka.",
  "BritishSlangMate": "Slang brytyjski oznaczający \"przyjaciel\". Podobne do \"dude\" w amerykańskim angielskim.",
  "BritishSlangCheeky": "zawadiacki, zuchwały, bezczelny.",
  "BritishSlangBodged": "Sartaczyć. Używane do opisania czegoś, zwykle pracy, która jest wykonana źle.",
  "BritishSlangGutted": "Bardzo rozczarowany lub zmartwiony.",
  "BritishSlangQuid": "Słowo slangowe oznaczające \"funt\".",
  "BritishSlangKnackered": "Bardzo zmęczony, wyczerpany.",
  "BritishSlangDodgy": "Podejrzany. Używane do określenia czegoś, co jest niskiej jakości, potencjalnie niebezpieczne lub niewiarygodne.",
  "AmericanSlangLegit": "Coś, co jest dobre lub wartościowe. Skrót od słowa legitimate (oznaczającego autentyczny lub prawdziwy).",
  "AmericanSlangGoDutch": "Każda osoba płaci za swoje jedzenie/napoje.",
  "AmericanSlangZoneOut": "Wyłączyć się, odpłynąć (myślami).",
  "AmericanSlangDude": "Używane często w slangu amerykańskim, określenie kolegi, przyjaciela.",
  "AmericanSlangCurveBall": "Coś podstępnego lub nieoczekiwanego, jak próba uderzenia podkręconej piłki w baseballu.",
  "AmericanSlangDitch": "Opuszczenie miejsca lub osoby niespodziewanie lub niepojawienie się na wcześniejsze plany.",
  "AmericanSlangHaveDibsOn": "Mieć prawo do posiadania lub otrzymania czegoś, zaklepać coś sobie."
}
